app/controllers/songs_controller.rb

SELECT "songs".* FROM "songs"
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1]]
---
   def index
    @songs = Song.all
    if params[:artist_id]
       if Artist.find_by(id: params[:artist_id])

SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 2]]
---
  def show
    @song = Song.find(params[:id])
    if Song.find_by(id: params[:id])
      @song = Song.find(params[:id])
      if params[:artist_id]
        unless Artist.find(params[:artist_id]).songs.include?(@song)